I'm not able to reproduce this issue. Looking at the plan output above, it doesn't show new volumes being created. It does show the `digitalocean_volume_attachment` "resources" being re-created. These are "virtual" resources representing the link between the existing Droplets and volumes. Recreating a `digitalocean_volume_attachment` doesn't actually recreate a volume. I've tried both with  v0.11.14 and v0.12.8. In both cases, the volumes created in the first run remain attached to the same Droplets after increasing the count and re-applying.

When using a newer version of Terraform the output is different and hides some of the noise. Using v0.12.8 when I increase `kafka_count = 2` to `kafka_count = 3`, running plan reports:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_droplet.kafka[2] will be created
  + resource "digitalocean_droplet" "kafka" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "ubuntu-18-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "kafka-003"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "nyc3"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
    }

  # digitalocean_volume.kafka[2] will be created
  + resource "digitalocean_volume" "kafka" {
      + droplet_ids             = (known after apply)
      + filesystem_label        = (known after apply)
      + filesystem_type         = (known after apply)
      + id                      = (known after apply)
      + initial_filesystem_type = "ext4"
      + name                    = "kafka-003"
      + region                  = "nyc3"
      + size                    = 10
      + urn                     = (known after apply)
    }

  # digitalocean_volume_attachment.kafka[2] will be created
  + resource "digitalocean_volume_attachment" "kafka" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + volume_id  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

Let us know if this answers your concern or if there's more information you can provide to help us better understand the problem.